app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["description", "testtest"], ["created_at", "2025-09-04 15:16:48.282421"], ["updated_at", "2025-09-04 15:16:48.282421"]]